{
    "home": {
        "title": "Zorg dat je wedstrijd perfect verloopt met TeamWhistle",
        "goals": "TeamWhistle laat je het aantal doelpunten bijhouden voor elk team en toont een geschiedenis van in welke minuut elk doelpunt werd gemaakt.",
        "time": "Op het hoofdscherm van de tijd zie je de resterende tijd, maar ook andere nuttige informatie zoals de eerstvolgende verstrijkende kaart of de timer voor spelers om zich klaar te maken voor een strafcorner.",
        "cards": "Met TeamWhistle kun je nauwkeurig elke kaart bijhouden met rugnummer, reden en resterende tijd.",
        "shootouts": "Elke shootout kan individueel worden bijgehouden en TeamWhistle laat je weten wanneer er een winnaar is bepaald.",
        "workouts": "Tijdens een wedstrijd worden je loopsnelheid, afgelegde afstand en hartslag gevolgd en opgeslagen in je persoonlijke gezondheidsgegevens.",
        "customization": "TeamWhistle heeft zeer uitgebreide instellingen waarmee je kunt bepalen welke trillingen, pop-ups en acties plaatsvinden.",
        "synchronisationHeadline": "En de grootste functie van allemaal...,",
        "synchronisation": "Gebruikers kunnen hun wedstrijd synchroniseren over hun apparaten, zodat elke actie zoals het pauzeren van de timer of het toevoegen van een kaart ook gebeurt bij andere gebruikers. Nu hoef je je nooit meer zorgen te maken over het vergeten van de tijd hervatten of het verkeerd toevoegen van een kaart!"
    },
    "docs": {
        "whatisteamwhistle": {
            "title": "Wat is TeamWhistle?",
            "text1": "TeamWhistle is een watchOS-app voor hockeyscheidsrechters om informatie van wedstrijden bij te houden. De app heeft veel verschillende functies en is uitgebreid ontwikkeld om in elk gebruiksscenario te helpen."
        },
        "gettingstarted": {
            "title": "Aan de slag",
            "text1": "TeamWhistle is momenteel alleen te downloaden via de Apple Store. De app is alleen beschikbaar voor Apple Watches met minimaal watchOS versie 9.6.",
            "tip1": "Heb je de app gekocht maar kun je deze niet vinden op je Apple Watch? Ga naar de Apple Store, scroll naar beneden, klik op Aankopen en zoek de TeamWhistle-app. Klik op het downloadpictogram om deze op je watch te installeren.",
            "text2": "Bij het eerste openen van de app krijg je een startgids. Deze vraagt om je toestemming om je locatie en trainingsactiviteit bij te houden. TeamWhistle gebruikt deze gegevens in overeenstemming met ons privacybeleid.",
            "tip2": "Je kunt je toestemming voor workouts en locatie op elk moment wijzigen in de instellingen van je Apple Watch."
        },
        "matches": {
            "title": "Wedstrijden",
            "text1": "De kernfunctionaliteit van TeamWhistle is het bijhouden van hockeywedstrijden. Je kunt je wedstrijden bekijken en aanmaken door op het fluitpictogram bovenaan het startscherm te klikken.",
            "tip1": "Onderaan de lijst kun je alle wedstrijden verwijderen. Je kunt ook een wedstrijdrij naar links vegen om deze snel te starten of te verwijderen.",
            "heading1": "Een wedstrijd aanmaken",
            "text2": "Om een nieuwe wedstrijd aan te maken, klik je op 'Add Match' linksboven. Je wordt gevraagd informatie over de wedstrijd in te voeren, zoals teams, datum, periodes en meer. Op het eerste scherm zie je twee rijen, de bovenste voor het thuisteam en de onderste voor het uitteam. In de rij kun je de teamnaam invoeren met tekst, anders wordt dit standaard 'Home/Awayclub'. Je kunt ook een naam selecteren uit een lijst door op het pijltje naar beneden op de rij te tikken. Veeg naar rechts in dit scherm om de kapiteinnummers van dat team in te voeren. Ten slotte kun je een kleur voor het team kiezen door op de gekleurde cirkel te drukken. Dit geeft een overzicht van standaardkleuren. Als je de gewenste kleur niet kunt vinden, kun je ook kiezen uit een veel grotere selectie door naar rechts te vegen en op de knop 'Color Picker' te klikken. Nadat je een kleur hebt gekozen, verandert deze automatisch en kun je het scherm sluiten door op 'Close' te tikken.",
            "text3": "Op de volgende pagina kun je de datum en tijd selecteren en optioneel een kleine notitie toevoegen over de wedstrijd.",
            "text4": "De derde pagina stelt je in staat doelstellingen voor de wedstrijd toe te voegen en te kiezen of het een binnen- of buitenwedstrijd is. Dit beïnvloedt specifieke regels zoals de duur van kaarten. Doelstellingen zijn kleine taken die je voor jezelf kunt instellen om op de wedstrijd te focussen. Je kunt meerdere doelstellingen toevoegen door op de knop 'Objectives' te klikken en vervolgens op 'Add'. Dit geeft een lijst van standaarddoelstellingen of je kunt je eigen toevoegen door op 'Add' te drukken. Om een doelstelling te verwijderen, veeg je de rij naar links en klik je op het prullenbakpictogram.",
            "text5": "Op de laatste pagina kun je kiezen hoe de periodes worden beheerd. Standaard is dit 4x17,5 minuten met korte pauzes van 2 minuten en één pauze van 5 minuten. Je kunt kiezen uit een lijst van standaardperiodeconfiguraties door op het pijltje naast 'Presets' te drukken. Je kunt ook een aangepaste configuratie maken of verwijderen door op het prullenbakpictogram rechtsboven te drukken, nieuwe periodes toevoegen met het plus-icoon en een periode bewerken door erop te tikken.",
            "text6": "Als je klaar bent, kun je de wedstrijd opslaan door op 'Create' op de laatste pagina te drukken. De wedstrijd wordt dan toegevoegd aan de lijst met wedstrijden.",
            "heading2": "Een wedstrijd bekijken",
            "text7": "Om een wedstrijd te bekijken, klik je op een wedstrijd uit de lijst. Dit opent het wedstrijdscherm waar je de wedstrijd kunt starten en beheren. Het scherm verandert afhankelijk van of de wedstrijd al is afgerond. Voor elke wedstrijd worden de teams, datum, binnen of buiten en je doelstellingen weergegeven. Een wedstrijd die nog niet is afgerond toont de periodes, anders worden de score en kaarten in een verticale tijdlijn weergegeven, en als die er zijn, ook de shootouts.",
            "tip2": "Als de wedstrijd is afgerond, kunnen doelstellingen worden beoordeeld van 1 tot 5 sterren door erop te tikken. Ga naar het menu in de wedstrijddlijst en klik op 'Objective Performance' om grafieken over tijd voor elke doelstelling te bekijken. Zo zie je hoe goed je op elke doelstelling hebt gepresteerd.",
            "heading3": "Een wedstrijd bewerken of verwijderen",
            "text8": "Om een wedstrijd te bewerken, klik je erop en ga je naar beneden om te bewerken of te verwijderen. Bewerken opent dezelfde aanmaakflow als eerder, maar met alle eerder ingevulde gegevens. Je kunt alles wijzigen en opnieuw opslaan door op 'Save' te drukken. Het verwijderen van een wedstrijd verwijdert deze permanent uit je lijst.",
            "heading4": "Een wedstrijd starten",
            "warning1": "Om een wedstrijd te starten, klik je op een wedstrijd uit de lijst en druk je op de knop 'Start' onderaan. Je wordt dan uit de lijst gehaald en naar schermen geleid die volledig op de huidige wedstrijd gericht zijn.",
            "tip3": "Je kunt ook een wedstrijd snel starten door een rij naar links te vegen en op het groene start-icoon te tikken."
        },
        "runningamatch": {
            "title": "Tijdens een wedstrijd",
            "text1": "Tijdens een wedstrijd verfijnt TeamWhistle de interface om de focus op de wedstrijd te houden. Veeg naar links of rechts om tussen schermen te navigeren. Hieronder vind je een lijst van alle beschikbare schermen tijdens een wedstrijd.",
            "tip1": "Tijdens een wedstrijd worden alle gegevens automatisch opgeslagen in de interne database. Als je de app afsluit of beëindigt, blijven alle wijzigingen behouden en worden deze weergegeven bij het opnieuw starten van de wedstrijd.",
            "warning1": "Als de app onverwacht wordt afgesloten (bijvoorbeeld door een crash of het dwingen van afsluiten), zal de app automatisch opnieuw opstarten en je vragen of je de wedstrijd opnieuw wilt laden. Alle gegevens tot het laatste opgeslagen punt blijven behouden.",
            "warning2": "Tijdens een wedstrijd gaat de batterij van je Apple Watch sneller leeg. Het is geadviseerd om je watch volledig op te laden voor een wedstrijd.",
            "heading1": "Tijd",
            "text2": "Het tijdscherm is het primaire scherm en staat centraal. Hier zie je de resterende tijd van de huidige periode en de totale verstreken tijd van de wedstrijd. Er is ook een timer voor strafcorners die je kunt starten en stoppen. Je kunt snel zien hoeveel spelers op het veld staan voor elk team via het X vs X. Onderaan heb je een knop om de timer te starten en te pauzeren. Als de timer is gepauzeerd, kun je ook een afteltimer gebruiken door op het timerpictogram links van de startknop te drukken. Deze start de tijd automatisch wanneer de aftelling eindigt. Als de timer gepauzeerd is, verschijnt er een stopwatch in het midden die aangeeft hoeveel seconden de timer gepauzeerd is. Als de timer loopt, wordt de eerstvolgende verstrijkende kaart weergegeven met kleur, teamnaam en resterende tijd.",
            "tip2": "Dit scherm kan verschillende trillingen geven, afhankelijk van de situatie. Bij pauzeren/starten van de timer wordt een sterke trilling gegeven. Tijdens de strafcorneraftelling wordt een korte trilling gegeven bij 20 en 10 seconden, evenals bij het starten. De stopwatch voor gepauzeerde tijd trilt standaard elke 10 seconden kort. Aan het einde van een periode wordt standaard 10 seconden lang een lange trilling gegeven.",
            "heading2": "Doelpunten",
            "text3": "In het doelpunten-scherm kun je snel doelpunten toevoegen voor elk team. Links is het thuisteam en rechts het uitteam. Houd een teller ingedrukt om deze met één te verhogen en een kleine trilling te krijgen. Tik op 'History' om alle doelpunten te zien. Veeg een doelpunt naar links en druk op het prullenbakpictogram om het te verwijderen.",
            "heading3": "Kaarten",
            "text4": "Het kaartenscherm is voor het beheren van alle gegeven kaarten. Druk op 'Add card' onderaan om een kaart toe te voegen. Kies team, reden, speler, type kaart en of het voor de kapitein is. De kaart verschijnt in de lijst met resterende tijd en details. Tik op een kaart om te verwijderen. Bij afloop van een kaart krijg je standaard een sterke 10 seconden durende trilling en een notificatie met team, nummer en type kaart.",
            "tip3": "Als een kaart voor hetzelfde rugnummer al is gegeven, wordt het kaarttype zwart weergegeven.",
            "heading4": "Statistieken",
            "text5": "Het statistiekenscherm toont alle trainingsactiviteit tijdens de wedstrijd. Je ziet de verstreken tijd, hartslag en afgelegde afstand.",
            "tip4": "Trainingsgegevens worden opgeslagen in je persoonlijke gezondheidsgegevens en niet in de TeamWhistle-database. Beheer deze in de Apple Health-app.",
            "heading5": "Instellingen",
            "text6": "Op het meest linkse tabblad vind je alle wedstrijdinstellingen. Je kunt periodes wijzigen, tijd aanpassen, shootouts starten en meer. Informatie over shootouts, synchronisatie en locatie vind je in andere hoofdstukken.",
            "heading6": "Een wedstrijd bewerken of beëindigen",
            "text7": "Bewerken kan via 'Edit Match' in het instellingen-scherm. Dit opent dezelfde interface als bij aanmaken of bewerken van een wedstrijd. Bij beëindigen krijg je een overzicht van statistieken zoals doelpunten, kaarten, shootouts en trainingsactiviteit.",
            "warning3": "Bij wijzigen van periodes wordt de tijd teruggezet naar de eerste periode.",
            "heading7": "Extra schermen",
            "text8": "In de instellingen kun je extra schermen openen zoals een checklist en muntopgooi. De muntopgooi toont willekeurig 'Heads' of 'Tails'. Je kunt ook kiezen welk team start.",
            "heading8": "Pictogrammen bovenin",
            "text9": "Linksboven zie je pictogrammen voor kleine informatie. Een hardloopfiguur geeft aan of een training loopt. Rood = niet actief, geel = gepauzeerd, groen = actief. Bij batterij <50% verschijnt een pictogram met een gedeeltelijk gevulde circel radius in relatie met je huide batterij perfcentage. Als de circel geel is is het tussen 50 en 25 procent. Als het rood is dan is je batterij onder 25 procent. Het laatste pictogram is voor synchronisatie: groen = actief, rood = fout by het ophalen van data uit de server."
        },
        "shootouts": {
            "title": "Shootouts",
            "text1": "Om shootouts te starten, ga naar het instellingen-scherm en druk op de knop 'Start Shootouts'. Dit vervangt je tijd- en doelpuntenweergave door een shootout-timer en een lijst van alle shootouts.",
            "heading1": "Shootout-timer",
            "text2": "De shootout-timer telt af vanaf 8 of 6 seconden, afhankelijk van of de wedstrijd binnen of buiten is. Bij het einde krijg je een trilling en notificatie, vergelijkbaar met de normale tijdweergave.",
            "heading2": "Shootout-doelpunten",
            "text3": "In het doelpunten-scherm wordt elke shootout weergegeven met een paar stippen die aangeven of het thuis- en uitteam heeft gescoord. De geselecteerde shootout heeft een witte omlijning. Druk op de knop doelpunt of gemist om de kleur van de stip te wijzigen en de volgende shootout te selecteren. Elke serie heeft zijn eigen pagina met 3 of 5 paar stippen, afhankelijk van binnen- of buitenwedstrijd. Je kunt een stip verwijderen met het prullenbak-icoon. Het team wisselen kan met het dubbelpijltje-icoon.",
            "tip1": "TeamWhistle wisselt automatisch het geselecteerde team bij een nieuwe serie. Bovenaan zie je een klein bericht als er genoeg shootouts zijn om een winnaar te garanderen.",
            "heading3": "Shootouts beëindigen",
            "text4": "Om shootouts te beëindigen, ga terug naar het instellingen-scherm en druk op 'Stop Shootouts'. Je keert terug naar de normale tijd- en doelpuntenweergave."
        },
        "synchronisation": {
            "title": "Synchronisatie",
            "text1": "TeamWhistle heeft een revolutionair synchronisatiesysteem waarmee je wedstrijdgegevens naadloos kunt delen met collega’s. Hierdoor blijven alle apparaten up-to-date en consistent, zodat niemand vergeet de tijd te starten of een doelpunt verkeerd noteert.",
            "warning1": "Synchronisatie vereist een internetverbinding. Zorg dat je Apple Watch een mobiele verbinding heeft of gekoppeld is aan een iPhone met internet.",
            "warning2": "Bij synchronisatie verzamelt TeamWhistle wedstrijdgegevens op onze cloudservers. Zie ons privacybeleid voor meer informatie.",
            "heading1": "Een wedstrijd hosten",
            "text2": "Ga naar instellingen en druk op de knop 'Synchronisation'. Geef je naam op om jezelf te identificeren en klik op 'Launch' om verbinding te maken met de server. Je ziet een lijst van aangesloten spelers en een 4-lettercode die anderen kunnen gebruiken om deel te nemen.",
            "warning3": "De server moet actief zijn om te functioneren. Het kan enkele minuten duren voordat een inactieve server reageert.",
            "heading2": "Deelnemen aan een wedstrijd",
            "text3": "Ga naar de wedstrijddlijst, druk op het menu rechtsboven en kies 'Join a Match'. Voer de 4-lettercode van de host en je naam in. Je wordt naar de wedstrijdweergave gebracht zoals bij het starten van een eigen wedstrijd.",
            "warning4": "De server moet actief zijn om correct te functioneren. Dit kan enkele minuten duren als de server recent niet actief was.",
            "heading3": "Synchronisatie tijdens een wedstrijd",
            "text4": "Tijdens synchronisatie worden alle acties zoals tijd, kaarten of doelpunten automatisch in realtime gesynchroniseerd. Het kan enkele seconden duren voordat alle apparaten up-to-date zijn. Een klein synchronisatie-icoon verschijnt linksboven: groen = verbinding goed, rood = fout.",
            "tip1": "In het synchronisatie-scherm in instellingen zie je alle deelnemers. Een kroon-icoon staat naast de host.",
            "heading4": "Synchronisatie beëindigen",
            "text5": "Ga naar instellingen en druk op 'Synchronisation'. Klik op 'Disband' om de synchronisatie voor jezelf te beëindigen. Je blijft de wedstrijd gewoon runnen.",
            "warning5": "Alle andere apparaten blijven verbonden. Je naam blijft zichtbaar voor anderen. Wedstrijden die 3 uur niet zijn gewijzigd, worden verwijderd van de server."
        },
        "location": {
            "title": "Locatie",
            "text1": "TeamWhistle kan je locatie gebruiken om heatmaps en workout routes van je positie op het veld te tonen. Tijdens een wedstrijd worden altijd workout routes gemaakt en opgeslagen indien je daarvoor toestemming heb gegeven. Ga naar instellingen tijdens een wedstrijd en druk op 'Location' om een hittekaart te maken.",
            "warning1": "Zorg dat je locatie toegang hebt toegestaan in je Watch-instellingen. TeamWhistle heeft alleen toegang nodig tijdens gebruik van de app.",
            "heading1": "Kalibratie",
            "text2": "TeamWhistle moet de positie van de linkerbovenhoek en rechteronderhoek van het veld kennen. Je hebt 3 opties: kies een preset van hockeyvelden, gebruik je huidige locatie door naar de hoeken te lopen, of selecteer een plek op de kaart (alleen buiten).",
            "tip1": "Je kunt de kalibratie op elk moment wijzigen door nieuwe waarden in te voeren en op 'Confirm Calibration' te drukken. De heatmap wordt bijgewerkt.",
            "heading2": "Heatmap",
            "text3": "Na kalibratie kun je een heatmap van je positie bekijken. TeamWhistle genereert elke 10 seconden een kleine rode stip met lage opacity tijdens actieve periodes.",
            "warning2": "Locatie gegevens worden alleen opgeslagen zolang de app open is. Alle gegevens worden niet opgeslagen in de database en verdwijnen bij afsluiten van de app."
        },
        "settings": {
            "title": "Instellingen",
            "text1": "In het instellingen-scherm kun je TeamWhistle aanpassen. Toegang via het tandwiel-icoon linksonder op het startscherm. Instellingen zijn verdeeld in 3 categorieën: Tijd, Notificaties en Overige.",
            "heading1": "Tijd",
            "text2": "Je kunt een lijst van seconden instellen voor trillingen voor het einde van een periode. Ook kun je de trilling per seconde aanpassen. Verwijder een seconde via het prullenbak-icoon.",
            "tip1": "Bij 'Vibration depending on how many minutes left' ontvang je een aantal middelsterke trillingen gelijk aan het aantal minuten. Bijvoorbeeld: 3 minuten = 3 trillingen.",
            "text3": "Pas ook de seconden voor pauzes aan, de afteltimer, en schakel automatisch pauzeren in bij het toevoegen van een doelpunt of starten van een strafcorneraftelling.",
            "heading2": "Notificaties",
            "text4": "Kies de trilling en duur bij het einde van de timer of een kaart. Bij 'None' wordt geen trilling of notificatie gegeven. Pas ook de frequentie van trillingen tijdens gepauzeerde tijd aan.",
            "heading3": "Overige",
            "text5": "Hier stel je in wat de Digital Crown doet op het tijdscherm, automatische terugkeer naar tijdscherm bij dimmen, land van clublijst, redenen voor kaarten en items in checklist voor extra schermen. Verwijder items via het prullenbak-icoon.",
            "tip2": "Houd een rij van checklist of kaartreden ingedrukt en sleep om de volgorde te wijzigen."
        },
        "actionbutton": {
            "title": "Actieknop",
            "text1": "TeamWhistle ondersteunt de Apple Watch Ultra. Je kunt TeamWhistle toewijzen aan de Actieknop in de Apple Watch-instellingen. Standaard opent de app en start de eerstvolgende wedstrijd in de toekomst.",
            "warning1": "Als er geen komende wedstrijden zijn, opent de knop gewoon de app. Voltooi eerst de startgids als je dat nog niet hebt gedaan.",
            "heading1": "Tijdens een wedstrijd",
            "text2": "Tijdens een wedstrijd start de actieknop de strafcornerafteller. Je kunt de wedstrijd pauzeren of hervatten door tegelijkertijd op de zijknop en Actieknop te drukken."
        }
    },
    "qna": {
        "title": "Veelgestelde vragen",
        "q1": {
            "q": "Waar is TeamWhistle beschikbaar?",
            "a": "TeamWhistle is alleen beschikbaar voor Apple Watches met minimaal watchOS versie 9.6."
        },
        "q2": {
            "q": "Hoe installeer ik TeamWhistle?",
            "a": "TeamWhistle kan via de App Store op je Apple Watch of gekoppelde iPhone worden geïnstalleerd. Als de app niet automatisch wordt gedownload, ga naar de App Store op je Apple Watch, scroll naar Account, tik op Aankopen en zoek TeamWhistle om handmatig te downloaden."
        },
        "q3": {
            "q": "Wat kost TeamWhistle?",
            "a": "Niets. De app is volledig gratis te gebruiken zodat iedereen ervan kan profiteren."
        },
        "q4": {
            "q": "Wie heeft TeamWhistle gemaakt?",
            "a": "TeamWhistle is gemaakt door Hawkeye Development, een klein indie-ontwikkelstudio opgericht door Homerus Hoogland. Als bondsscheidsrechter in opleiding in Nederland en student Informatica, ontwikkelde Homerus TeamWhistle om het gebrek aan fluit-apps voor Apple Watch op te lossen en scheidsrechters beter te ondersteunen."
        },
        "q5": {
            "q": "Hoe kan ik contact opnemen?",
            "a": "Via de Contactpagina op deze site (link bovenin) of via onze Discord-server (icoon onderaan). Je kunt ook een e-mail sturen naar developmenthawkeye@gmail.com."
        }
    }
}
